In [1]:
import pandas as pd

In [7]:
df_age = pd.read_csv("../DATA/BC_BSN_AGE_CNT_202006.csv")
df_tm = pd.read_csv("../DATA/BC_BSN_TM_CNT_202006.csv")
df_week = pd.read_csv("../DATA/BC_BSN_WEEK_CNT_202006.csv")
df_wk = pd.read_csv("../DATA/BC_BSN_WK_CNT_202006.csv")

In [16]:
df_age

      BASE_YEAR  BASE_MONTH GU_DC AGE_DC  MV_CNT
0          2016           1   강서구    10대     412
1          2016           1   강서구    20대     948
2          2016           1   강서구    30대    2384
3          2016           1   강서구    40대    2524
4          2016           1   강서구    50대    2463
...         ...         ...   ...    ...     ...
5371       2019          12  해운대구    30대    3651
5372       2019          12  해운대구    40대    4442
5373       2019          12  해운대구    50대    4158
5374       2019          12  해운대구    60대    2686
5375       2019          12  해운대구    70대    2144

[5376 rows x 5 columns]

In [17]:
df_tm

       BASE_YEAR  BASE_MONTH GU_DC TIME_DC  MV_CNT
0           2016           1   강서구      0시   13417
1           2016           1   강서구     10시   30544
2           2016           1   강서구     11시   29098
3           2016           1   강서구     12시   28016
4           2016           1   강서구     13시   28050
...          ...         ...   ...     ...     ...
18427       2019          12  해운대구      5시   25876
18428       2019          12  해운대구      6시   25612
18429       2019          12  해운대구      7시   25253
18430       2019          12  해운대구      8시   24752
18431       2019          12  해운대구      9시   24590

[18432 rows x 5 columns]

In [22]:
df_week

      BASE_YEAR  BASE_MONTH GU_DC WEEK_DC  MV_CNT
0          2016           1   강서구       금   10468
1          2016           1   강서구       목   11671
2          2016           1   강서구       수   11897
3          2016           1   강서구       월   11251
4          2016           1   강서구       일    7225
...         ...         ...   ...     ...     ...
5371       2019          12  해운대구       수   25077
5372       2019          12  해운대구       월   24820
5373       2019          12  해운대구       일   26387
5374       2019          12  해운대구       토   26291
5375       2019          12  해운대구       화   24917

[5376 rows x 5 columns]

In [19]:
df_wk

      BASE_YEAR  BASE_MONTH GU_DC WORKTIME_DC  MV_CNT
0          2016           1   강서구          출근   32833
1          2016           1   강서구          퇴근   20904
2          2016           1   금정구          출근   11695
3          2016           1   금정구          퇴근   12641
4          2016           1   기장군          출근   32420
...         ...         ...   ...         ...     ...
1531       2019          12   영도구          퇴근   10712
1532       2019          12    중구          출근    7243
1533       2019          12    중구          퇴근   11127
1534       2019          12  해운대구          출근   24865
1535       2019          12  해운대구          퇴근   25551

[1536 rows x 5 columns]

In [23]:
print(df_age.groupby("BASE_YEAR").sum()["MV_CNT"])
print(df_tm.groupby("BASE_YEAR").sum()["MV_CNT"])
print(df_week.groupby("BASE_YEAR").sum()["MV_CNT"])
print(df_wk.groupby("BASE_YEAR").sum()["MV_CNT"])

BASE_YEAR
2016    3180474
2017    3484026
2018    3558825
2019    3466603
Name: MV_CNT, dtype: int64
BASE_YEAR
2016    77336429
2017    82294288
2018    83907736
2019    82739363
Name: MV_CNT, dtype: int64
BASE_YEAR
2016    22279368
2017    24388788
2018    24910168
2019    24261278
Name: MV_CNT, dtype: int64
BASE_YEAR
2016    6297477
2017    6927784
2018    7106526
2019    6940294
Name: MV_CNT, dtype: int64

In [26]:
df_week.head()

   BASE_YEAR  BASE_MONTH GU_DC WEEK_DC  MV_CNT
0       2016           1   강서구       금   10468
1       2016           1   강서구       목   11671
2       2016           1   강서구       수   11897
3       2016           1   강서구       월   11251
4       2016           1   강서구       일    7225